The placeholder curve will not be able to connect to the required fittings for placeholder convert
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ValidatePHSegmentConnWarning { get; }
  Visual Basic
Public Shared ReadOnly Property ValidatePHSegmentConnWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ValidatePHSegmentConnWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GenericMEPFailures Class
  Autodesk.Revit.DB Namespace